---
type: PipePlumbingFixtureFlowData
namespace: Autodesk.Revit.DB.Plumbing
version: 2024
members: 7
tags: [revit-api, class]
---

# PipePlumbingFixtureFlowData

`Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | DimensionFlow | 2014 | `public double DimensionFlow { get ; }` |
| Property | FixtureUnits | 2014 | `public double FixtureUnits { get ; }` |
| Property | Flow | 2014 | `public double Flow { get ; set ; }` |
| Property | FlowConfiguration | 2014 | `public PipeFlowConfigurationType FlowConfiguration { get ; }` |
| Property | FlowConversionMode | 2014 | `public FlowConversionMode FlowConversionMode { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |